membership-common/src/test/resources/stripe/event.json

{
  "id": "blah",
  "object": "event",
  "api_version": "2016-03-07",
  "created": 1459858022,
  "data": {
    "object": {
      "id": "chargeid",
      "object": "charge",
      "amount": 1000,
      "amount_refunded": 0,
      "application_fee": null,
      "balance_transaction": "blah",
      "captured": true,
      "created": 1459858022,
      "currency": "gbp",
      "customer": null,
      "description": "Your contribution",
      "destination": null,
      "dispute": null,
      "failure_code": null,
      "failure_message": null,
      "fraud_details": {
      },
      "invoice": null,
      "livemode": false,
      "metadata": {
        "marketing-opt-in": "true",
        "postcode": "AAA",
        "email": "alex@example.com",
        "name": "A"
      },
      "order": null,
      "paid": true,
      "receipt_email": "alex@example.com",
      "receipt_number": null,
      "refunded": false,
      "refunds": {
        "object": "list",
        "data": [
        ],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges/id/refunds"
      },
      "shipping": null,
      "source": {
        "id": "card",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "US",
        "customer": null,
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 1,
        "exp_year": 2017,
        "fingerprint": "fingerprint",
        "funding": "credit",
        "last4": "4242",
        "metadata": {
        },
        "name": null,
        "tokenization_method": null
      },
      "source_transfer": null,
      "statement_descriptor": null,
      "status": "succeeded"
    }
  },
  "livemode": false,
  "pending_webhooks": 0,
  "request": "request",
  "type": "charge.succeeded"
}