membership-common/src/test/resources/stripe/failedCharge.json

{
  "id": "evt_18zLeuCbpG0cQtlbDgbmP7EP",
  "object": "event",
  "api_version": "2016-03-07",
  "created": 1475241336,
  "data": {
    "object": {
      "id": "ch_18zUytRbpG0cjdye76ytdj",
      "object": "charge",
      "amount": 500,
      "amount_refunded": 0,
      "application_fee": null,
      "balance_transaction": null,
      "captured": false,
      "created": 1475241336,
      "currency": "gbp",
      "customer": null,
      "description": "Your contribution",
      "destination": null,
      "dispute": null,
      "failure_code": "card_declined",
      "failure_message": "Your card was declined.",
      "fraud_details": {},
      "invoice": null,
      "livemode": true,
      "metadata": {
        "contributionId": "61ff2a6b-e7b5-4267-b082-a87cda497ea3",
        "intcmp": "anIntCmpCode",
        "marketing-opt-in": "false",
        "ophanId": "itpgnzkecyhuiwefhuifehu",
        "postcode": "A1B 2C4",
        "abTests": "[]",
        "email": "john.doe@example.com",
        "name": "John.Doe"
      },
      "order": null,
      "paid": false,
      "receipt_email": "john.doe@example.com",
      "receipt_number": null,
      "refunded": false,
      "refunds": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges/ch_18zUytRbpG0cjdye76ytdj/refunds"
      },
      "shipping": null,
      "source": {
        "id": "card_18zLeqCbpG0cQtlhueiwfhueio",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": null,
        "address_zip_check": null,
        "brand": "Visa",
        "country": "GB",
        "customer": null,
        "cvc_check": "fail",
        "dynamic_last4": null,
        "exp_month": 5,
        "exp_year": 2036,
        "fingerprint": "jieojiopwg89igr",
        "funding": "debit",
        "last4": "5555",
        "metadata": {},
        "name": null,
        "tokenization_method": null
      },
      "source_transfer": null,
      "statement_descriptor": null,
      "status": "failed"
    }
  },
  "livemode": true,
  "pending_webhooks": 1,
  "request": "req_9HhgyugyhkvTO",
  "type": "charge.failed"
}