membership-common/src/test/resources/stripe/subscription.json

{
    "id": "sub_1L8mv1JETvkRwpwqhowvEOlL",
    "object": "subscription",
    "application": null,
    "application_fee_percent": null,
    "automatic_tax": {
        "enabled": false
    },
    "billing": "charge_automatically",
    "billing_cycle_anchor": 1654787107,
    "billing_thresholds": null,
    "cancel_at": null,
    "cancel_at_period_end": false,
    "canceled_at": null,
    "collection_method": "charge_automatically",
    "created": 1654787107,
    "current_period_end": 1657379107,
    "current_period_start": 1654787107,
    "customer": {
        "id": "cus_LqTr7x0vLYkXR6",
        "object": "customer",
        "account_balance": 0,
        "address": {
            "city": "London",
            "country": "GB",
            "line1": "Kings Place",
            "line2": "York Way",
            "postal_code": "N1 9GU",
            "state": ""
        },
        "balance": 0,
        "created": 1654787033,
        "currency": "gbp",
        "default_source": "card_1L8mugJETvkRwpwqhOBJQSuz",
        "delinquent": false,
        "description": null,
        "discount": null,
        "email": "no-on@thegulocal.com",
        "invoice_prefix": "685F229A",
        "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null,
            "rendering_options": null
        },
        "livemode": false,
        "metadata": {},
        "name": "Joe Bloggs",
        "next_invoice_sequence": 2,
        "phone": null,
        "preferred_locales": [],
        "shipping": null,
        "sources": {
            "object": "list",
            "data": [
                {
                    "id": "card_1L8mugJETvkRwpwqhOBJQSuz",
                    "object": "card",
                    "address_city": null,
                    "address_country": null,
                    "address_line1": null,
                    "address_line1_check": null,
                    "address_line2": null,
                    "address_state": null,
                    "address_zip": null,
                    "address_zip_check": null,
                    "brand": "Visa",
                    "country": "US",
                    "customer": "cus_LqTr7x0vLYkXR6",
                    "cvc_check": "pass",
                    "dynamic_last4": null,
                    "exp_month": 2,
                    "exp_year": 2027,
                    "fingerprint": "d14IdZbO6E5DtC9v",
                    "funding": "credit",
                    "last4": "4242",
                    "metadata": {},
                    "name": null,
                    "tokenization_method": null
                }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_LqTr7x0vLYkXR6/sources"
        },
        "subscriptions": {
            "object": "list",
            "data": [
                {
                    "id": "sub_1L8mv1JETvkRwpwqhowvEOlL",
                    "object": "subscription",
                    "application": null,
                    "application_fee_percent": null,
                    "automatic_tax": {
                        "enabled": false
                    },
                    "billing": "charge_automatically",
                    "billing_cycle_anchor": 1654787107,
                    "billing_thresholds": null,
                    "cancel_at": null,
                    "cancel_at_period_end": false,
                    "canceled_at": null,
                    "collection_method": "charge_automatically",
                    "created": 1654787107,
                    "current_period_end": 1657379107,
                    "current_period_start": 1654787107,
                    "customer": "cus_LqTr7x0vLYkXR6",
                    "days_until_due": null,
                    "default_payment_method": null,
                    "default_source": null,
                    "default_tax_rates": [],
                    "description": null,
                    "discount": null,
                    "ended_at": null,
                    "invoice_customer_balance_settings": {
                        "consume_applied_balance_on_void": true
                    },
                    "items": {
                        "object": "list",
                        "data": [
                            {
                                "id": "si_LqTsvtdmm6h1lb",
                                "object": "subscription_item",
                                "billing_thresholds": null,
                                "created": 1654787108,
                                "metadata": {},
                                "plan": {
                                    "id": "recurring_month_1200",
                                    "object": "plan",
                                    "active": true,
                                    "aggregate_usage": null,
                                    "amount": 10000,
                                    "amount_decimal": "10000",
                                    "billing_scheme": "per_unit",
                                    "created": 1549030940,
                                    "currency": "gbp",
                                    "interval": "month",
                                    "interval_count": 1,
                                    "livemode": false,
                                    "metadata": {},
                                    "nickname": "1200 MONTH",
                                    "product": "prod_DSARLQMXTDrT7L",
                                    "tiers": null,
                                    "tiers_mode": null,
                                    "transform_usage": null,
                                    "trial_period_days": null,
                                    "usage_type": "licensed"
                                },
                                "price": {
                                    "id": "recurring_month_1200",
                                    "object": "price",
                                    "active": true,
                                    "billing_scheme": "per_unit",
                                    "created": 1549030940,
                                    "currency": "gbp",
                                    "livemode": false,
                                    "lookup_key": null,
                                    "metadata": {},
                                    "nickname": "1200 MONTH",
                                    "product": "prod_DSARLQMXTDrT7L",
                                    "recurring": {
                                        "aggregate_usage": null,
                                        "interval": "month",
                                        "interval_count": 1,
                                        "trial_period_days": null,
                                        "usage_type": "licensed"
                                    },
                                    "tax_behavior": "unspecified",
                                    "tiers_mode": null,
                                    "transform_quantity": null,
                                    "type": "recurring",
                                    "unit_amount": 10000,
                                    "unit_amount_decimal": "10000"
                                },
                                "quantity": 1,
                                "subscription": "sub_1L8mv1JETvkRwpwqhowvEOlL",
                                "tax_rates": []
                            }
                        ],
                        "has_more": false,
                        "total_count": 1,
                        "url": "/v1/subscription_items?subscription=sub_1L8mv1JETvkRwpwqhowvEOlL"
                    },
                    "latest_invoice": "in_1L8mv1JETvkRwpwqhzyNQ3gz",
                    "livemode": false,
                    "metadata": {},
                    "next_pending_invoice_item_invoice": null,
                    "pause_collection": null,
                    "payment_settings": {
                        "payment_method_options": null,
                        "payment_method_types": null,
                        "save_default_payment_method": "off"
                    },
                    "pending_invoice_item_interval": null,
                    "pending_setup_intent": null,
                    "pending_update": null,
                    "plan": {
                        "id": "recurring_month_1200",
                        "object": "plan",
                        "active": true,
                        "aggregate_usage": null,
                        "amount": 10000,
                        "amount_decimal": "10000",
                        "billing_scheme": "per_unit",
                        "created": 1549030940,
                        "currency": "gbp",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "nickname": "1200 MONTH",
                        "product": "prod_DSARLQMXTDrT7L",
                        "tiers": null,
                        "tiers_mode": null,
                        "transform_usage": null,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "quantity": 1,
                    "schedule": null,
                    "start": 1654787107,
                    "start_date": 1654787107,
                    "status": "active",
                    "tax_percent": null,
                    "test_clock": null,
                    "transfer_data": null,
                    "trial_end": null,
                    "trial_start": null
                }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_LqTr7x0vLYkXR6/subscriptions"
        },
        "tax_exempt": "none",
        "tax_ids": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_LqTr7x0vLYkXR6/tax_ids"
        },
        "tax_info": null,
        "tax_info_verification": null,
        "test_clock": null
    },
    "days_until_due": null,
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discount": null,
    "ended_at": null,
    "invoice_customer_balance_settings": {
        "consume_applied_balance_on_void": true
    },
    "items": {
        "object": "list",
        "data": [
            {
                "id": "si_LqTsvtdmm6h1lb",
                "object": "subscription_item",
                "billing_thresholds": null,
                "created": 1654787108,
                "metadata": {},
                "plan": {
                    "id": "recurring_month_1200",
                    "object": "plan",
                    "active": true,
                    "aggregate_usage": null,
                    "amount": 10000,
                    "amount_decimal": "10000",
                    "billing_scheme": "per_unit",
                    "created": 1549030940,
                    "currency": "gbp",
                    "interval": "month",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {},
                    "nickname": "1200 MONTH",
                    "product": "prod_DSARLQMXTDrT7L",
                    "tiers": null,
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                },
                "price": {
                    "id": "recurring_month_1200",
                    "object": "price",
                    "active": true,
                    "billing_scheme": "per_unit",
                    "created": 1549030940,
                    "currency": "gbp",
                    "livemode": false,
                    "lookup_key": null,
                    "metadata": {},
                    "nickname": "1200 MONTH",
                    "product": "prod_DSARLQMXTDrT7L",
                    "recurring": {
                        "aggregate_usage": null,
                        "interval": "month",
                        "interval_count": 1,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "tax_behavior": "unspecified",
                    "tiers_mode": null,
                    "transform_quantity": null,
                    "type": "recurring",
                    "unit_amount": 10000,
                    "unit_amount_decimal": "10000"
                },
                "quantity": 1,
                "subscription": "sub_1L8mv1JETvkRwpwqhowvEOlL",
                "tax_rates": []
            }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1L8mv1JETvkRwpwqhowvEOlL"
    },
    "latest_invoice": "in_1L8mv1JETvkRwpwqhzyNQ3gz",
    "livemode": false,
    "metadata": {},
    "next_pending_invoice_item_invoice": null,
    "pause_collection": null,
    "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
    },
    "pending_invoice_item_interval": null,
    "pending_setup_intent": null,
    "pending_update": null,
    "plan": {
        "id": "recurring_month_1200",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 10000,
        "amount_decimal": "10000",
        "billing_scheme": "per_unit",
        "created": 1549030940,
        "currency": "gbp",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": "1200 MONTH",
        "product": "prod_DSARLQMXTDrT7L",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
    },
    "quantity": 1,
    "schedule": null,
    "start": 1654787107,
    "start_date": 1654787107,
    "status": "active",
    "tax_percent": null,
    "test_clock": null,
    "transfer_data": null,
    "trial_end": null,
    "trial_start": null
}
